{
  "backend/main.mo": "Main backend actor implementing user profiles, contact management, invite code generation, RSVP submission, and access control with authorization checks for all operations.",
  "feature_evidence.json": "Feature evidence report mapping implemented features (username search, invite links, QR code generation/scanning, contacts list, UI design) to their source files, components, and test IDs.",
  "frontend-file-summaries.txt": "JSON object containing one-line summaries of all frontend files including components, pages, hooks, and configuration files with their key functionality.",
  "frontend/index.css": "Global Tailwind CSS styles defining warm earth tone color system using OKLCH values for light and dark modes with custom variables for UI components.",
  "frontend/index.html": "HTML entry point with root div and module script reference to main.tsx for the Quick Contacts application.",
  "frontend/src/App.tsx": "Root application component with TanStack Router setup, authentication flow via Internet Identity, profile setup modal trigger, and theme provider wrapping all routes.",
  "frontend/src/components/ContactCard.tsx": "Reusable card component displaying individual contact information (name, email, phone) with icons and warm earth tone styling.",
  "frontend/src/components/ContactsList.tsx": "Contacts list component fetching and displaying all user contacts with loading skeletons, empty state with hero image, and contact count header.",
  "frontend/src/components/InviteLinks.tsx": "React component for generating and accepting invite links/codes, with UI for copying invite URLs and a form to accept invites from URL parameters or manual input.",
  "frontend/src/components/Layout.tsx": "Main layout component with sticky header showing app branding and user profile, navigation tabs for Contacts/Search/Invite/Scan, theme toggle, and logout functionality.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog for first-time user profile setup that prompts for username creation and cannot be dismissed until completed.",
  "frontend/src/components/QRCodeGenerator.tsx": "Component that generates a QR code from an invite code using the qrcode.js CDN library and provides download functionality for the generated image.",
  "frontend/src/components/QRScanner.tsx": "QR code scanner component using camera access that detects invite codes from QR codes and automatically accepts invites, with camera switching and error handling.",
  "frontend/src/components/SearchContacts.tsx": "Search interface for finding users by Principal ID and adding them as contacts, with validation and error handling for invalid principals.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance with Internet Identity authentication, initializing access control and invalidating dependent queries on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React hook and provider for Internet Identity authentication, managing login state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for backend operations including user profiles, contacts management, user search, and invite code generation/acceptance.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom warm earth-tone color scheme (terracotta, sage, cream) for light and dark modes, plus gradient utility classes.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the root App component.",
  "frontend/src/pages/ContactsListPage.tsx": "Page component displaying a list of user contacts with header and description.",
  "frontend/src/pages/InviteLinksPage.tsx": "Tabbed page for generating and sharing invite links or QR codes, with separate views for each sharing method.",
  "frontend/src/pages/QRScannerPage.tsx": "Page component that displays a QR code scanner interface for adding contacts by scanning their QR codes.",
  "frontend/src/pages/SearchContactsPage.tsx": "Page component for searching and adding contacts by principal ID with a search interface.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, persisting, and managing URL parameters from both query strings and hash-based routing, with sessionStorage integration.",
  "frontend/tailwind.config.js": "Tailwind configuration extending the theme with custom earth-tone colors (terracotta, sage, cream), OKLCH color system, custom border radii, shadows, and animations.",
  "project_state.json": "Project state file for a contact management app with invite links, QR codes, and username search. Tracks existing features (username search, invite links, QR generation/scanning, contacts list, UI design) and pending backend features (user registry, invite link generation, contact management system)."
}